# SQL

In [1]:
import pandas as pd
import numpy as np

* step 1 - figure out sql engine you are connecting to 
* step 2 - install the approproate Python driver library
* step 3 - use sqlalchemy library to connect to sql database with the driver
* step 4 - use the sqlalchemy driver connection with pandas read_sql method

In [2]:
from sqlalchemy import create_engine

## Establish Connection

In [3]:
# create a tempurary database in ram

# for Postgre sql use the following command to connect to engine
# "postgresql+psycopg2://scott:tiger@192.168.0.199:5432/test?sslmode=require"

# for sql lite
temp_db = create_engine('sqlite:///:memore:')

In [4]:
df = pd.DataFrame(data=np.random.randint(low=0,high=100,size=(4,4)), columns = ["a","b", "c", "d"])

In [5]:
df

    a   b   c   d
0  99  27  73  19
1  32  30  85  38
2  58  57  80   2
3  73  10  68  73

## 1st way of reading a sql

In [6]:
# we will take the above table 
# and write it to the data base
# that we have created above

df.to_sql(name="new_table",con=temp_db, index = False)

4

In [7]:
# read an entire table

new_df = pd.read_sql(sql="new_table", con=temp_db)

In [8]:
new_df

    a   b   c   d
0  99  27  73  19
1  32  30  85  38
2  58  57  80   2
3  73  10  68  73

## 2nd way fo reading a sql

In [9]:
# pass in a sql quarry into pandas
# it will perform that quarry and return the results from it 
# as a dataframe

# you have to provide a sql quarry as a sting inseide
# 1 sort by sql
# 2 return in python

result =pd.read_sql_query(sql='SELECT a,c FROM new_table', con =temp_db)

In [10]:
result

    a   c
0  99  73
1  32  85
2  58  80
3  73  68